DataProcessors/абс_ФормированиеСтопЛистаПоКонтрагентам/абс_ФормированиеСтопЛистаПоКонтрагентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>абс_ФормированиеСтопЛистаПоКонтрагентам</name>
  <tabularSections>
    <name>Контрагенты</name>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДопустимаяСуммаЗадолженности</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопустимоеЧислоДнейЗадолженности</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОбщейЗадолженности</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПросроченнойЗадолженности</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДнейПросроченнойЗадолженности</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийРазделСтопЛиста</name>
      <type>
        <types>EnumRef.абс_СтатусыЗадолженности</types>
      </type>
    </attributes>
    <attributes>
      <name>РазделСтопЛиста</name>
      <type>
        <types>EnumRef.абс_СтатусыЗадолженности</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентПДЗ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопустимаяСуммаПросроченнойЗадолженности</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаАктуальности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

InformationRegisters/абс_КонтрольДЗПоЗаказам/абс_КонтрольДЗПоЗаказам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_КонтрольДЗПоЗаказам</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СтатусДЗ</name>
    <type>
      <types>EnumRef.абс_СтатусыДЗПоЗаказам</types>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринудительнаяБлокировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредоплатныйЗаказ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Enums/абс_СтатусыДЗПоЗаказам/абс_СтатусыДЗПоЗаказам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыДЗПоЗаказам</name>
  <enumValues>
    <name>Блокирован</name>
  </enumValues>
  <enumValues>
    <name>Разблокирован</name>
  </enumValues>
</mdclass:Enum>

Enums/абс_СтатусыЗадолженности/абс_СтатусыЗадолженности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыЗадолженности</name>
  <enumValues>
    <name>ПревышениеКредитногоЛимита</name>
  </enumValues>
  <enumValues>
    <name>ПревышениеЛимитаПДЗПоСумме</name>
  </enumValues>
  <enumValues>
    <name>ПревышениеЧислаДнейЗадолженности</name>
  </enumValues>
  <enumValues>
    <name>Разблокирован</name>
  </enumValues>
  <enumValues>
    <name>МораторнаяЗадолженность</name>
  </enumValues>
</mdclass:Enum>

DataProcessors/абс_ФормированиеСтопЛистаПоКонтрагентам/Forms/Форма/Module.bsl
&НаКлиенте
Процедура СнятьФлажки(Команда)
	Для Каждого Строка ИЗ Объект.Контрагенты Цикл
		Строка.Пометка = Ложь;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	Для Каждого Строка ИЗ Объект.Контрагенты Цикл
		Строка.Пометка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьКонтрагентовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтрагентовНаСервере()
	
	ТаблицаСтопЛиста = абс_УправлениеДебиторскойЗадолженностью.ПолучитьТаблицуСтопЛиста();
	
	Объект.Контрагенты.Загрузить(ТаблицаСтопЛиста);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатус(Команда)
	
	УстановитьСтатусыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСтатусыНаСервере()
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	
	ТаблицаСтопЛписта = ЭтотОбъект.Контрагенты.Выгрузить();
	
	абс_УправлениеДебиторскойЗадолженностью.УстановитьСтатусыСтопЛиста(ТаблицаСтопЛписта);
	
	ЭтотОбъект.Контрагенты.Загрузить(ТаблицаСтопЛписта);
	
	ЗначениеВРеквизитФормы(ЭтотОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура РазблокироватьЗаказ(Команда)
	
	Если Элементы.Заказы.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивЗаказов = Новый Массив;
	
	Для каждого НомерСтроки из Элементы.Заказы.ВыделенныеСтроки Цикл
		МассивЗаказов.Добавить(Элементы.Заказы.ДанныеСтроки(НомерСтроки).ЗаказПокупателя);
	КонецЦикла;
	
	РазблокироватьЗаказСервер(МассивЗаказов, Истина);
	
	Элементы.Заказы.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура РазблокироватьЗаказСервер(МассивЗаказов, ВыполнятьРассылку = Ложь)
	
	Для Каждого ЗаказПокупателя ИЗ МассивЗаказов Цикл
		НаборЗаписей = РегистрыСведений.абс_КонтрольДЗПоЗаказам.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ЗаказПокупателя.Установить(ЗаказПокупателя);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = ТекущаяДата();
		НоваяЗапись.ЗаказПокупателя = ЗаказПокупателя;
		НоваяЗапись.СтатусДЗ=Перечисления.абс_СтатусыДЗПоЗаказам.Разблокирован;
		НоваяЗапись.ПринудительнаяБлокировка = Ложь;
		ПредоплатныйЗаказ = ЗапросПредоплатностиЗаказа(ЗаказПокупателя);
		Если ПредоплатныйЗаказ = Истина Тогда
			НоваяЗапись.ПредоплатныйЗаказ = Истина;	
		КонецЕсли;	
		НаборЗаписей.Записать();
		Если ВыполнятьРассылку Тогда
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("Контрагент", ЗаказПокупателя.Контрагент);
			СтруктураПараметров.Вставить("РазделСтопЛиста", Перечисления.абс_СтатусыЗадолженности.Разблокирован);
			СтруктураПараметров.Вставить("ЗаказПокупателя", ЗаказПокупателя);
			
			абс_ОбменДаннымиСервер.ВыполнитьРассылкуБлокировкиЗаказа(СтруктураПараметров);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//+Лаврухин
Функция ЗапросПредоплатностиЗаказа(ЗаказПокупателя)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	абс_КонтрольДЗПоЗаказам.ПредоплатныйЗаказ КАК ПредоплатныйЗаказ
	               |ИЗ
	               |	РегистрСведений.абс_КонтрольДЗПоЗаказам КАК абс_КонтрольДЗПоЗаказам
	               |ГДЕ
	               |	абс_КонтрольДЗПоЗаказам.ЗаказПокупателя = &Заказ";
	Запрос.УстановитьПараметр("Заказ", ЗаказПокупателя);
	Результат = Запрос.Выполнить().Выгрузить();	
	
	//СтатусДЗ = Перечисления.абс_СтатусыДЗПоЗаказам.ПустаяСсылка();
	Для Каждого Строка Из Результат Цикл
		ПредоплатныйЗаказ = Строка.ПредоплатныйЗаказ;
	КонецЦикла;
	
	Возврат ПредоплатныйЗаказ;
	
КонецФункции
//-Лаврухин


&НаКлиенте
Процедура ЗаказыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ФормаЗаказа = Элементы.Заказы.ТекущиеДанные.ЗаказПокупателя.ПолучитьФорму();
	ФормаЗаказа.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура РазблокироватьБезРассылки(Команда)
	
	Если Элементы.Заказы.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивЗаказов = Новый Массив;
	
	Для каждого НомерСтроки из Элементы.Заказы.ВыделенныеСтроки Цикл
		МассивЗаказов.Добавить(Элементы.Заказы.ДанныеСтроки(НомерСтроки).ЗаказПокупателя);
	КонецЦикла;
	
	РазблокироватьЗаказСервер(МассивЗаказов);
	
	Элементы.Заказы.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не РольДоступна("ПолныеПрава") И Не РольДоступна("абс_ФормированиеСтопЛиста") Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтчетМораторнаяЗадолженность(Команда)
	
	ТабДок = СформироватьОтчетМораторнаяЗадолженностьСервер();
	ТабДок.Показать();
	
КонецПроцедуры

&НаСервере
Функция СформироватьОтчетМораторнаяЗадолженностьСервер()
	
	СтруктураПараметров = абс_УправлениеДебиторскойЗадолженностью.СформироватьОтчетСтопЛистМораторнаяЗадолженность();
	ТабДок = СтруктураПараметров.ТабДок;
	Возврат ТабДок;
	
КонецФункции

&НаКлиенте
Процедура ОтчетСтолЛист(Команда)
	
	ТабДок = СформироватьОтчетСтопЛистСервер();
	ТабДок.Показать();
	
КонецПроцедуры

&НаСервере
Функция СформироватьОтчетСтопЛистСервер();
	
	СтруктураПараметров = абс_УправлениеДебиторскойЗадолженностью.СформироватьОтчетСтопЛистПросроченнаяЗадолженность();
	ТабДок = СтруктураПараметров.ТабДок;
	Возврат ТабДок;
	
КонецФункции

//<< Горбунов ограничил права для пользователей по заказу Воронова
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если
		ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.Лео_ФормированиеСтопЛистаПросмотр)
		Тогда
		Отказ = Ложь;
		ЭтаФорма.ТолькоПросмотр = Истина;
		Элементы.СтопЛист.Доступность = Ложь;
		Элементы.ОтчетСтолЛист.Доступность = Ложь;
		Элементы.ОтчетМораторнаяЗадолженность.Доступность = Ложь;
	ИначеЕсли
		ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.Лео_ФормированиеСтопЛистаБухгалтерия)
		Тогда
		Отказ = Ложь;
		ЭтаФорма.ТолькоПросмотр = Истина;
	Иначе
		Предупреждение("Запрещенно открывать данную форму");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
//>> Горбунов

//+Лаврухин 17.09.2014
&НаКлиенте
Процедура Переформирование_STOP_листа(Команда)
	
	абс_РегламентныеЗадания.абс_ОбработкаСтопЛиста();
	//абс_РегламентныеЗадания.абс_РассылкаСтопЛиста();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаказы(Команда)
	Элементы.Заказы.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ЗаблокироватьБезРассылки(Команда)
	
	Если Элементы.ЗаблокированныеЗаказы1.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивЗаказов = Новый Массив;
	
	Для каждого НомерСтроки из Элементы.ЗаблокированныеЗаказы1.ВыделенныеСтроки Цикл
		МассивЗаказов.Добавить(Элементы.ЗаблокированныеЗаказы1.ДанныеСтроки(НомерСтроки).ЗаказПокупателя);
	КонецЦикла;
	
	ЗаблокироватьЗаказСервер(МассивЗаказов);
	
	Элементы.ЗаблокированныеЗаказы1.Обновить();
	Элементы.Заказы.Обновить();

КонецПроцедуры

&НаСервере
Процедура ЗаблокироватьЗаказСервер(МассивЗаказов, ВыполнятьРассылку = Ложь)
	
	Для Каждого ЗаказПокупателя ИЗ МассивЗаказов Цикл
		НаборЗаписей = РегистрыСведений.абс_КонтрольДЗПоЗаказам.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ЗаказПокупателя.Установить(ЗаказПокупателя);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = ТекущаяДата();
		НоваяЗапись.ЗаказПокупателя = ЗаказПокупателя;
		НоваяЗапись.СтатусДЗ=Перечисления.абс_СтатусыДЗПоЗаказам.Блокирован;
		НоваяЗапись.ПринудительнаяБлокировка = Истина;
		НаборЗаписей.Записать();
		Если ВыполнятьРассылку Тогда
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("Контрагент", ЗаказПокупателя.Контрагент);
			СтруктураПараметров.Вставить("РазделСтопЛиста", Перечисления.абс_СтатусыЗадолженности.Разблокирован);
			СтруктураПараметров.Вставить("ЗаказПокупателя", ЗаказПокупателя);
			
			абс_ОбменДаннымиСервер.ВыполнитьРассылкуБлокировкиЗаказа(СтруктураПараметров);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПринРазблокироватьЗаказ(Команда)
		Если Элементы.ПринудительнаяБлокировкаЗаказов.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивЗаказов = Новый Массив;
	
	Для каждого НомерСтроки из Элементы.ПринудительнаяБлокировкаЗаказов.ВыделенныеСтроки Цикл
		МассивЗаказов.Добавить(Элементы.ПринудительнаяБлокировкаЗаказов.ДанныеСтроки(НомерСтроки).ЗаказПокупателя);
	КонецЦикла;
	
	РазблокироватьЗаказСервер(МассивЗаказов, Истина);
	
	Элементы.ПринудительнаяБлокировкаЗаказов.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура ПринОбновить(Команда)
	Элементы.ПринудительнаяБлокировкаЗаказов.Обновить();
КонецПроцедуры
//-Лаврухин 17.09.2014

//+Лаврухин 16.02.2015
&НаКлиенте
Процедура РазблокированныеЗаблокироватьЗаказСервер(МассивЗаказов, ВыполнятьРассылку = Истина) 
	
	Для Каждого ЗаказПокупателя ИЗ МассивЗаказов Цикл
		НаборЗаписей = РегистрыСведений.абс_КонтрольДЗПоЗаказам.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ЗаказПокупателя.Установить(ЗаказПокупателя);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = ТекущаяДата();
		НоваяЗапись.ЗаказПокупателя = ЗаказПокупателя;
		НоваяЗапись.СтатусДЗ=Перечисления.абс_СтатусыДЗПоЗаказам.Блокирован;
		НоваяЗапись.ПринудительнаяБлокировка = Истина;
		НаборЗаписей.Записать();
		Если ВыполнятьРассылку Тогда
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("Контрагент", ЗаказПокупателя.Контрагент);
			СтруктураПараметров.Вставить("РазделСтопЛиста", Перечисления.абс_СтатусыЗадолженности.Разблокирован);
			СтруктураПараметров.Вставить("ЗаказПокупателя", ЗаказПокупателя);
			
			абс_ОбменДаннымиСервер.ВыполнитьРассылкуПолитическойБлокировкиЗаказа(СтруктураПараметров);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура БлокировкаРазблокированных(Команда)
	Если Элементы.ЗаблокированныеЗаказы1.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивЗаказов = Новый Массив;
	
	Для каждого НомерСтроки из Элементы.ЗаблокированныеЗаказы1.ВыделенныеСтроки Цикл
		МассивЗаказов.Добавить(Элементы.ЗаблокированныеЗаказы1.ДанныеСтроки(НомерСтроки).ЗаказПокупателя);
	КонецЦикла;
	
	РазблокированныеЗаблокироватьЗаказСервер(МассивЗаказов);
	
	Элементы.ЗаблокированныеЗаказы1.Обновить();
	Элементы.Заказы.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеЗаблокированных(Команда)
	Элементы.ЗаблокированныеЗаказы1.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ПринудительнаяБлокировкаЗаказовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ФормаЗаказа = Элементы.ПринудительнаяБлокировкаЗаказов.ТекущиеДанные.ЗаказПокупателя.ПолучитьФорму();
	ФормаЗаказа.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗаблокированныеЗаказы1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ФормаЗаказа = Элементы.ЗаблокированныеЗаказы1.ТекущиеДанные.ЗаказПокупателя.ПолучитьФорму();
	ФормаЗаказа.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ПринРазблокироватьЗаказБезРассылки(Команда)
	
	Если Элементы.ПринудительнаяБлокировкаЗаказов.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивЗаказов = Новый Массив;
	
	Для каждого НомерСтроки из Элементы.ПринудительнаяБлокировкаЗаказов.ВыделенныеСтроки Цикл
		МассивЗаказов.Добавить(Элементы.ПринудительнаяБлокировкаЗаказов.ДанныеСтроки(НомерСтроки).ЗаказПокупателя);
	КонецЦикла;
	
	РазблокироватьЗаказСервер(МассивЗаказов, Ложь);
	
	Элементы.ПринудительнаяБлокировкаЗаказов.Обновить();

	
КонецПроцедуры

&НаКлиенте
Процедура ПереформированиеРазослать_STOP_листа(Команда)
	абс_РегламентныеЗадания.абс_ОбработкаСтопЛиста();
	абс_РегламентныеЗадания.абс_РассылкаСтопЛиста();
КонецПроцедуры

//-Лаврухин 16.02.2015
